Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
          ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "D",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "E"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Container Restarts (5m) alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Container Restarts (5m) alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "155"
              + "__dashboardUid__" = "fxisR13Zz"
              + "__panelId__"      = "4"
              + "message"          = ""
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "eecbadc3-04e9-49ea-9f9c-d9cda5d3773b"
            }
          + name           = "Container Restarts (5m) alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum (rate(kube_pod_container_status_restarts_total{namespace=\"logcollect\", container=\"cloudwatchlogs-collector\"}[5m]) * 60 * 5) by (container)"
                      + format         = "time_series"
                      + instant        = false
                      + interval       = ""
                      + intervalFactor = 1
                      + legendFormat   = "{{ container }}"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 2,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "max"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/CoreDNS unavailable alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "CoreDNS unavailable alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "169"
              + "__dashboardUid__" = "bj5-ZEhWk"
              + "__panelId__"      = "3"
              + "message"          = "One more instances of CoreDNS are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "be4b444e-c0f1-49f5-b91b-8ab88b846e40"
            }
          + name           = "CoreDNS unavailable alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum by (deployment) (kube_deployment_spec_replicas{namespace=\"kube-system\", deployment=\"coredns\"}) - sum by (deployment) (kube_deployment_status_replicas_available{namespace=\"kube-system\", deployment=\"coredns\"})"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "Unavailable"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/EC2 Worker Node Credit Balance alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 300
      + name               = "EC2 Worker Node Credit Balance alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "160"
              + "__dashboardUid__" = "GUakfOpMk"
              + "__panelId__"      = "16"
              + "message"          = "An EC2 instance has used its CPU Credit Balance. Performance issues may be encountered on this Kubernetes node, please check node CPU usage and take action to resolve or consider upgrading or changing the node instance type."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "f06c1563-dd85-46a9-8755-f25b37521fdf"
            }
          + name           = "EC2 Worker Node Credit Balance alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "edp232mk1y58gc"
              + model          = jsonencode(
                    {
                      + alias      = ""
                      + dimensions = {
                          + InstanceId = "*"
                        }
                      + expression = ""
                      + id         = ""
                      + matchExact = true
                      + metricName = "CPUCreditBalance"
                      + namespace  = "AWS/EC2"
                      + period     = "300"
                      + refId      = "A"
                      + region     = "default"
                      + statistics = [
                          + "Average",
                        ]
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 1,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Failed Restore Counts alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Failed Restore Counts alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "180"
              + "__dashboardUid__" = "YAniUGC"
              + "__panelId__"      = "28"
              + "message"          = "A Velero restore to the cluster has failed.  Please use the Velero CLI to retrieve the backup logs to assist in investigation of the issue."
            }
          + condition      = "C"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "d489cd0d-896c-4d16-9abb-355d37f2c4a6"
            }
          + name           = "Failed Restore Counts alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_restore_failed_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_restore_partial_failure_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "C"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Fluentd  daemonset running timeseries alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Fluentd  daemonset running timeseries alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "163"
              + "__dashboardUid__" = "70pnQaxZz"
              + "__panelId__"      = "16"
              + "message"          = "One or more fluentd pods are not running"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "cff9b7b0-449a-4f0c-9a3c-08bbf47ef925"
            }
          + name           = "Fluentd  daemonset running timeseries alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 1,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(up{pod=~\"fluentd.*\"}) by (service) - sum(up{pod=~\"fluentd.*\"}) by (service)"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "{{service}}"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Fluentd available buffer space ratio alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Fluentd available buffer space ratio alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "164"
              + "__dashboardUid__" = "70pnQaxZz"
              + "__panelId__"      = "10"
              + "message"          = "Available buffer space is below 25% for at least one fluentd pod."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "e3f65059-6c23-4670-b2b8-f812a008cad5"
            }
          + name           = "Fluentd available buffer space ratio alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 25,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "fluentd_output_status_buffer_available_space_ratio"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "{{pod}}"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Goldpinger.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Goldpinger alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "165"
              + "__dashboardUid__" = "D4EyPQTWk"
              + "__panelId__"      = "25"
              + "message"          = "Goldpinger instance has been reporting unhealthy nodes for at least 5 minutes."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ddc49fdf-cf2b-40a3-b121-2f60bddbfe23"
            }
          + name           = "Goldpinger alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum(goldpinger_nodes_health_total{status=\"unhealthy\"}) by (goldpinger_instance)"
                      + format         = "time_series"
                      + intervalFactor = 1
                      + legendFormat   = "{{ goldpinger_instance }}"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Is cluster version past EOL.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Is cluster version past EOL"

      + rule {
          + annotations    = {
              + "__alertId__"      = "162"
              + "__dashboardUid__" = "YMBzktpGz"
              + "__panelId__"      = "16"
              + "message"          = "Current cluster version is past EOL"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ebdbc94a-a7e2-44ed-8bca-60dcc7f9e988"
            }
          + name           = "Is cluster version past EOL"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource     = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + expr           = "eks_version_exporter_is_past_eol"
                      + format         = "time_series"
                      + instant        = false
                      + intervalFactor = 1
                      + legendFormat   = "is_outdated"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 60
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.9,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Kafka-exporter up alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Kafka-exporter up alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "167"
              + "__dashboardUid__" = "CoYn_3-nk"
              + "__panelId__"      = "2"
              + "message"          = "Kafka-exporter metrics cannot be scraped either because it is down or the scrape timeout is excided"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "e64ff644-e9ac-4077-8337-4a56bf57097f"
            }
          + name           = "Kafka-exporter up alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + exemplar     = true
                      + expr         = "up{job=\"kafka-exporter\"}"
                      + interval     = ""
                      + legendFormat = "{{job}}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Kube-Proxy unavailable alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Kube-Proxy unavailable alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "168"
              + "__dashboardUid__" = "bj5-ZEhWk"
              + "__panelId__"      = "2"
              + "message"          = "One more instances of kube-proxy are unavailable! Please see \"Kubernetes Components\" dashboard for more details."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ac76e773-f347-4e27-b67a-e3308cfe1395"
            }
          + name           = "Kube-Proxy unavailable alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "sum by (daemonset) (kube_daemonset_status_desired_number_scheduled{namespace=\"kube-system\", daemonset=\"kube-proxy\"}) - sum by (daemonset) (kube_daemonset_status_number_available{namespace=\"kube-system\", daemonset=\"kube-proxy\"})"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "Unavailable"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Memory Capacity Utilization Alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Memory Capacity Utilization Alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "158"
              + "__dashboardUid__" = "s_zMzas4z"
              + "__panelId__"      = "6"
              + "message"          = "Elevated memory capacity utilization"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ce530e1d-3432-4807-8f29-5e3c984c542c"
            }
          + name           = "Memory Capacity Utilization Alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.85,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + expr         = "sum(namespace_memory:kube_pod_container_resource_requests:sum{}) / sum(kube_node_status_allocatable{resource=\"memory\"})"
                      + legendFormat = "Memory Capacity Utilization"
                      + range        = true
                      + refId        = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Misuse of priority classes.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Misuse of priority classes"

      + rule {
          + annotations    = {
              + "__alertId__"      = "175"
              + "__dashboardUid__" = "W8nct6zGz"
              + "__panelId__"      = "6"
              + "message"          = "Misuse of priority classes detected"
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "add33528-1eaa-4d5d-af5b-3de4b93f5a42"
            }
          + name           = "Misuse of priority classes"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=\"selfservice\", namespace!=\"selfservice\", namespace!=\"selfservice-herald-vbqkr\", namespace!=\"developerautomation-xavgy\", namespace!=\"velero\"}) by (pririty_class, namespace)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 1
                      + legendFormat   = "Selfservice priority class"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 3600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.5,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/NodeNotReady.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "NodeNotReady"

      + rule {
          + annotations    = {
              + "__alertId__"      = "173"
              + "__dashboardUid__" = "KbpocXAVk"
              + "__panelId__"      = "3"
              + "message"          = "One or more nodes are in a NotReady state"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "1m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "c9a6b483-1488-4fe5-a790-1ff7445436bb"
            }
          + name           = "NodeNotReady"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "E",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + expr         = "sum(kube_node_status_condition{condition=\"Ready\",status!=\"true\"})"
                      + legendFormat = "__auto"
                      + range        = true
                      + refId        = "E"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Nodes by state alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Nodes by state alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "172"
              + "__dashboardUid__" = "KbpocXAVk"
              + "__panelId__"      = "2"
              + "message"          = "Nodes found in the \"not ready\" state."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ba0847b8-e010-4877-a43e-d64b9ec085dc"
            }
          + name           = "Nodes by state alert"
          + no_data_state  = "OK"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + exemplar     = true
                      + expr         = "sum(kube_node_status_condition{condition=~\"NotReady\"})"
                      + interval     = ""
                      + legendFormat = "Not Ready"
                      + range        = true
                      + refId        = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Pod Capacity Utilization Alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Pod Capacity Utilization Alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "156"
              + "__dashboardUid__" = "s_zMzas4z"
              + "__panelId__"      = "2"
              + "message"          = "Elevated pod capacity utilization"
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "f1593d7d-79b2-4542-9944-a7f65411bf5b"
            }
          + name           = "Pod Capacity Utilization Alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0.85,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "A"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + datasource   = {
                          + type = "prometheus"
                          + uid  = "prometheus"
                        }
                      + editorMode   = "code"
                      + expr         = "count(kube_pod_info)/sum(kube_node_status_capacity{resource=\"pods\"})"
                      + legendFormat = "Pod Capacity Utilization"
                      + range        = true
                      + refId        = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Priority Classes alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Priority Classes alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "154"
              + "__dashboardUid__" = "axdphXDZz"
              + "__panelId__"      = "10"
              + "message"          = "Unauthorised Use of Reserved Priority Classes"
            }
          + condition      = "E"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "eecf4258-4c13-4ff6-a614-24254d8fb5af"
            }
          + name           = "Priority Classes alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"system.*\",namespace!~\"kube-system|monitoring|flux-system|nvidia-device-plugin|metrics-server\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + intervalFactor = 2
                      + legendFormat   = "system*"
                      + refId          = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"service-critical\",namespace!~\"kube-system|velero\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 2
                      + legendFormat   = "service-critical"
                      + refId          = "B"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"cluster-monitoring\",namespace!~\"kube-system|monitoring|goldpinger|grafana|fluentd\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 2
                      + legendFormat   = "cluster-monitoring"
                      + refId          = "C"
                    }
                )
              + ref_id         = "C"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr           = "count(kube_pod_info{priority_class=~\"selfservice\",namespace!~\"selfservice|selfservice-herald-vbqkr|developerautomation-xavgy\"}) OR on() vector(0)"
                      + format         = "time_series"
                      + interval       = ""
                      + intervalFactor = 2
                      + legendFormat   = "selfservice"
                      + refId          = "D"
                    }
                )
              + ref_id         = "D"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "B",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "C",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "or"
                                }
                              + query     = {
                                  + params = [
                                      + "D",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "E"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "E"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Restore Validation Failure alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Restore Validation Failure alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "182"
              + "__dashboardUid__" = "YAniUGC"
              + "__panelId__"      = "33"
              + "message"          = "Validation of a velero restore has failed.  Please use the Velero CLI to retrieve the logs to assist in investigation of the issue."
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "5m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "a7ee5231-ac93-4e57-8991-8a18a8abe37f"
            }
          + name           = "Restore Validation Failure alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + expr         = "rate(velero_restore_validation_failed_total{schedule=~\"velero-hellman-cluster-backup\"}[24h:])  "
                      + interval     = ""
                      + legendFormat = ""
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 300
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 0,
                                    ]
                                  + type   = "gt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "last"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/SSL expiry alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 1440
      + name               = "SSL expiry alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "177"
              + "__dashboardUid__" = "bXDq_ZNnz"
              + "__panelId__"      = "192"
              + "message"          = ""
            }
          + condition      = "B"
          + exec_err_state = "Alerting"
          + for            = "1h"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "ed7bcdc2-07d7-4c4e-9cdd-e6580fb69fce"
            }
          + name           = "SSL expiry alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "grafanacloud-prom"
              + model          = jsonencode(
                    {
                      + exemplar     = true
                      + expr         = "probe_ssl_earliest_cert_expiry{} - time()"
                      + interval     = ""
                      + legendFormat = "{{ instance }}"
                      + refId        = "A"
                    }
                )
              + ref_id         = "A"

              + relative_time_range {
                  + from = 3600
                  + to   = 0
                }
            }
          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
                                      + 2592000,
                                    ]
                                  + type   = "lt"
                                }
                              + operator  = {
                                  + type = "and"
                                }
                              + query     = {
                                  + params = [
                                      + "A",
                                    ]
                                }
                              + reducer   = {
                                  + type = "avg"
                                }
                            },
                        ]
                      + refId      = "B"
                      + type       = "classic_conditions"
                    }
                )
              + ref_id         = "B"

              + relative_time_range {
                  + from = 0
                  + to   = 0
                }
            }
        }
    }

  # module.alerts[0].grafana_rule_group.alertrule["alertrules/Sockets used per node alert.json"] will be created
  + resource "grafana_rule_group" "alertrule" {
      + disable_provenance = false
      + folder_uid         = (known after apply)
      + id                 = (known after apply)
      + interval_seconds   = 60
      + name               = "Sockets used per node alert"

      + rule {
          + annotations    = {
              + "__alertId__"      = "174"
              + "__dashboardUid__" = "GGodmXAVz"
              + "__panelId__"      = "2"
              + "message"          = "Sockets used per node has reached an unusually high level."
            }
          + condition      = "A"
          + exec_err_state = "Alerting"
          + for            = "15m"
          + is_paused      = false
          + labels         = {
              + "rule_uid" = "e5600b97-49cc-4daa-9016-5bae3c84a365"
            }
          + name           = "Sockets used per node alert"
          + no_data_state  = "NoData"
          + uid            = (known after apply)

          + data {
              + datasource_uid = "__expr__"
              + model          = jsonencode(
                    {
                      + conditions = [
                          + {
                              + evaluator = {
                                  + params = [
     
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.